app/Models/Model_Auth.php

    public function getLevelName($levelId) {
        return $this->db->table('user_level')->where('id', $levelId)->get()->getRowArray()['nama'];
---
SELECT *
FROM "user_level"
WHERE "id" = '1'