app/Models/Model_Kos.php

SELECT *
FROM "tbl_kos"
---
    public function getAllData() {
        return $this->db->table('tbl_kos')->get()->getResultArray();