app/Models/Model_Fakultas.php

    public function getAllData() {
        return $this->db->table('area_fakultas')->get()->getResultArray();
---
SELECT *
FROM "area_fakultas"
SELECT *
FROM "tbl_fakultas"